import numpy as np
#16 Створіть матрицю розміром 3x3, заповніть її випадковими дійсними числами в діапазоні від 0 до 1 та знайдіть вектор-стовпчик, 
# що містить суму елементів кожного рядка матриці.
matrix = np.random.rand(3, 3)

# Виводимо початкову матрицю
print("Початкова матриця:")
print(matrix)

# Знаходимо вектор-стовпчик, що містить суму елементів кожного рядка матриці
row_sums = np.sum(matrix, axis=1)

# Перетворюємо вектор-рядок в вектор-стовпчик
column_vector = row_sums.reshape(-1, 1)

print("Вектор-стовпчик сум рядків матриці:")
print(column_vector)
