import numpy as np
#10 Створіть матрицю розміром 3x4 та вектор розміром 4, заповніть їх випадковими цілими числами в діапазоні від 1 до 10 та перемножте матрицю на вектор.
matrix = np.random.randint(1, 10, size=(3, 4))
vector = np.random.randint(1, 10, size=4)

print("Початкова матриця:")
print(matrix)
print("Початковий вектор:")
print(vector)

#Під час множення кожний рядок матриці перемножується з вектором, і результатом є 
# новий вектор розміром 3, де кожний елемент цього вектора - це сума добутків відповідних елементів рядка матриці на відповідні елементи вектора. 
result = np.dot(matrix, vector)
print("Результат множення матриці на вектор:")
print(result)

